In [3]:
# import libraries

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import plotly.express as px

import os

In [4]:
# Navigate one level up to the parent directory, this command changes your working directory to housing_in_mexico 
os.chdir('..')

In [5]:
# Read the datasets from data directory

path1 = os.path.join('data', 'mexico_housing_datasets','mexico-real-estate-1.csv' )
path2 = os.path.join('data', 'mexico_housing_datasets','mexico-real-estate-2.csv' )
path3 = os.path.join('data', 'mexico_housing_datasets','mexico-real-estate-3.csv' )

In [6]:
df1 = pd.read_csv(path1)
df2 = pd.read_csv(path2)
df3 = pd.read_csv(path3)

In [7]:
# See what is inside df1

df1.head()

,property_type,state,lat,lon,area_m2,price_usd
0,house,Estado de México,19.560181,-99.233528,150,"$67,965.56"
1,house,Nuevo León,25.688436,-100.198807,186,"$63,223.78"
2,apartment,Guerrero,16.767704,-99.764383,82,"$84,298.37"
3,apartment,Guerrero,16.829782,-99.911012,150,"$94,308.80"
4,house,Veracruz de Ignacio de la Llave,NaN,NaN,175,"$94,835.67"

In [8]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  700 non-null    object
 1   state          700 non-null    object
 2   lat            583 non-null    float64
 3   lon            583 non-null    float64
 4   area_m2        700 non-null    int64
 5   price_usd      700 non-null    object
dtypes: float64(2), int64(1), object(3)
memory usage: 32.9+ KB

In [9]:
df1.shape

(700, 6)

In [10]:
# Check null values
df1.isnull().sum()

property_type      0
state              0
lat              117
lon              117
area_m2            0
price_usd          0
dtype: int64

We can see some null values in lat and lon column

In [11]:
# Let's simply drop those null values

df1 = df1.dropna()
df1.isnull().sum()

property_type    0
state            0
lat              0
lon              0
area_m2          0
price_usd        0
dtype: int64

In [12]:
# clean price_usd column

df1['price_usd'] = (df1['price_usd']
                    .str.replace("$", "")
                    .str.replace(',', '')
                    .astype('float')
                    )

In [13]:
df1.head()

  property_type             state        lat         lon  area_m2  price_usd
0         house  Estado de México  19.560181  -99.233528      150   67965.56
1         house        Nuevo León  25.688436 -100.198807      186   63223.78
2     apartment          Guerrero  16.767704  -99.764383       82   84298.37
3     apartment          Guerrero  16.829782  -99.911012      150   94308.80
5         house           Yucatán  21.052583  -89.538639      205  105191.37

### df1 is clean, Now let's move on to df2

In [14]:
# Cleaning up the dataset df2
# when the data was collected in 2014, a dollar cost 19 pesos.
df2.head()

  property_type       state        lat         lon  area_m2  price_mxn
0     apartment  Nuevo León  25.721081 -100.345581       72    1300000
1     apartment      Puebla        NaN         NaN      190    2500000
2         house     Morelos  23.634501 -102.552788      360    5300000
3         house     Morelos        NaN         NaN       76     820000
4         house      Puebla        NaN         NaN      200    1100000

In [15]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  700 non-null    object
 1   state          700 non-null    object
 2   lat            571 non-null    float64
 3   lon            571 non-null    float64
 4   area_m2        700 non-null    int64
 5   price_mxn      700 non-null    int64
dtypes: float64(2), int64(2), object(2)
memory usage: 32.9+ KB

In [16]:
# Drop null values

df2.dropna(inplace=True)

In [18]:
# Create a new column with price in dollar
df2['price_usd'] = (df2['price_mxn'] / 19).round(2)

# We no longer need price_mxn column, let's drop it

df2.drop(columns=["price_mxn"], inplace=True)

In [19]:
df2.head()

  property_type             state        lat         lon  area_m2  price_usd
0     apartment        Nuevo León  25.721081 -100.345581       72   68421.05
2         house           Morelos  23.634501 -102.552788      360  278947.37
6     apartment  Estado de México  19.272040  -99.572013       85   65789.47
7         house   San Luis Potosí  22.138882 -100.996510      158  111578.95
8     apartment  Distrito Federal  19.394558  -99.129707       65   39904.74

In [20]:
# Time for df3

df3.head()

,property_type,place_with_parent_names,lat-lon,area_m2,price_usd
0,apartment,|México|Distrito Federal|Gustavo A. Madero|Acu...,"19.52589,-99.151703",71,48550.59
1,house,|México|Estado de México|Toluca|Metepec|,"19.2640539,-99.5727534",233,168636.73
2,house,|México|Estado de México|Toluca|Toluca de Lerd...,"19.268629,-99.671722",300,86932.69
3,house,|México|Morelos|Temixco|Burgos Bugambilias|,NaN,275,263432.41
4,apartment,|México|Veracruz de Ignacio de la Llave|Veracruz|,"19.511938,-96.871956",84,68508.67

In [22]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   property_type            700 non-null    object
 1   place_with_parent_names  700 non-null    object
 2   lat-lon                  582 non-null    object
 3   area_m2                  700 non-null    int64
 4   price_usd                700 non-null    float64
dtypes: float64(1), int64(1), object(3)
memory usage: 27.5+ KB

In [23]:
# Remove the "NaN" data
df3.dropna(inplace=True)

In [24]:

# split the lat and lon features and put in different columns
df3[["lat","lon"]] = df3["lat-lon"].str.split(",",expand=True)

In [25]:
df3.head()

,property_type,place_with_parent_names,lat-lon,area_m2,price_usd,lat,lon
0,apartment,|México|Distrito Federal|Gustavo A. Madero|Acu...,"19.52589,-99.151703",71,48550.59,19.52589,-99.151703
1,house,|México|Estado de México|Toluca|Metepec|,"19.2640539,-99.5727534",233,168636.73,19.2640539,-99.5727534
2,house,|México|Estado de México|Toluca|Toluca de Lerd...,"19.268629,-99.671722",300,86932.69,19.268629,-99.671722
4,apartment,|México|Veracruz de Ignacio de la Llave|Veracruz|,"19.511938,-96.871956",84,68508.67,19.511938,-96.871956
5,house,|México|Jalisco|Guadalajara|,"20.689157,-103.366728",175,102763.00,20.689157,-103.366728

In [29]:
# Drop lat-lon column
df3.drop('lat-lon', axis=1, inplace=True)

In [30]:
df3.head()

,property_type,place_with_parent_names,area_m2,price_usd,lat,lon
0,apartment,|México|Distrito Federal|Gustavo A. Madero|Acu...,71,48550.59,19.52589,-99.151703
1,house,|México|Estado de México|Toluca|Metepec|,233,168636.73,19.2640539,-99.5727534
2,house,|México|Estado de México|Toluca|Toluca de Lerd...,300,86932.69,19.268629,-99.671722
4,apartment,|México|Veracruz de Ignacio de la Llave|Veracruz|,84,68508.67,19.511938,-96.871956
5,house,|México|Jalisco|Guadalajara|,175,102763.00,20.689157,-103.366728

In [31]:
# Stract the "state of the "place_with_parent_names" variable
df3["state"] = df3["place_with_parent_names"].str.split("|",expand=True)[2]

In [32]:
df3.head()

,property_type,place_with_parent_names,area_m2,price_usd,lat,lon,state
0,apartment,|México|Distrito Federal|Gustavo A. Madero|Acu...,71,48550.59,19.52589,-99.151703,Distrito Federal
1,house,|México|Estado de México|Toluca|Metepec|,233,168636.73,19.2640539,-99.5727534,Estado de México
2,house,|México|Estado de México|Toluca|Toluca de Lerd...,300,86932.69,19.268629,-99.671722,Estado de México
4,apartment,|México|Veracruz de Ignacio de la Llave|Veracruz|,84,68508.67,19.511938,-96.871956,Veracruz de Ignacio de la Llave
5,house,|México|Jalisco|Guadalajara|,175,102763.00,20.689157,-103.366728,Jalisco

In [33]:
df3.drop('place_with_parent_names', axis=1, inplace=True)

In [34]:
df3.head()

,property_type,area_m2,price_usd,lat,lon,state
0,apartment,71,48550.59,19.52589,-99.151703,Distrito Federal
1,house,233,168636.73,19.2640539,-99.5727534,Estado de México
2,house,300,86932.69,19.268629,-99.671722,Estado de México
4,apartment,84,68508.67,19.511938,-96.871956,Veracruz de Ignacio de la Llave
5,house,175,102763.00,20.689157,-103.366728,Jalisco

In [35]:
final_df = pd.concat([df1,df2, df3])

In [36]:
final_df.head()

  property_type             state        lat         lon  area_m2  price_usd
0         house  Estado de México  19.560181  -99.233528      150   67965.56
1         house        Nuevo León  25.688436 -100.198807      186   63223.78
2     apartment          Guerrero  16.767704  -99.764383       82   84298.37
3     apartment          Guerrero  16.829782  -99.911012      150   94308.80
5         house           Yucatán  21.052583  -89.538639      205  105191.37

In [38]:
# Save the new clean dataset
# final_df.to_csv('../data/mexico_housing_datasets/mexico-real-state-clean.csv')
final_df.to_csv('mexico-real-state-clean.csv')